package пакСлово

/*
	Содержит все константы, которые могут содержаться в словах
*/

import (
	"oc/internal/types"
)

var (
	// ключевые слова

	//КсМодуль -- MODULE
	КсМодуль = []types.UWord{"MODULE", "МОДУЛЬ"}

	//КсИмпорт -- IMPORT
	КсИмпорт = []types.UWord{"IMPORT", "ИМПОРТ"}

	//КсКонст -- CONST
	КсКонст = []types.UWord{"CONST", "КОНСТ"}

	//КсТипы -- TYPE
	КсТипы = []types.UWord{"TYPE", "ТИПЫ"}

	//КсБулево -- BOOLEAN
	КсБулево = []types.UWord{"BOOLEAN", "БУЛЕВО"}

	//КсБайт -- BYTE
	КсБайт = []types.UWord{"BYTE", "БАЙТ"}

	//КсЦелое -- INTEGER
	КсЦелое = []types.UWord{"INTEGER", "ЦЕЛОЕ"}

	//КсЛит -- CHAR
	КсЛит = []types.UWord{"CHAR", "ЛИТ"}

	//КсНабор -- SET
	КсНабор = []types.UWord{"SET", "НАБОР"}

	//КсВещ -- REAL
	КсВещ = []types.UWord{"REAL", "ДРОБ", "ВЕЩ"}

	//КсПер -- VAR
	КсПер = []types.UWord{"VAR", "ПЕРЕМ", "ССЫЛКА"}

	//КсУказ -- POINTER
	КсУказ = []types.UWord{"POINTER", "УКАЗ", "УКАЗАТЕЛЬ"}

	//КсДо -- TO
	КсДо = []types.UWord{"TO", "НА"}

	//КсМассив -- ARRAY
	КсМассив = []types.UWord{"ARRAY", "МАС", "МАССИВ"}

	//КсИз -- OF
	КсИз = []types.UWord{"OF", "ИЗ"}

	//КсНачало -- BEGIN
	КсНачало = []types.UWord{"BEGIN", "НАЧ", "НАЧАЛО"}

	//КсКонец -- END
	КсКонец = []types.UWord{"END", "КОНЕЦ"}

	//КсПроцедура -- PROCEDURE
	КсПроцедура = []types.UWord{"PROCEDURE", "ПРОЦ", "ПРОЦЕДУРА"}

	//КсДля -- FOR
	КсДля = []types.UWord{"FOR", "ДЛЯ"}

	//КсПока -- WHILE
	КсПока = []types.UWord{"WHILE", "ПОКА"}

	//КсПовтор -- DO
	КсПовтор = []types.UWord{"DO", "ДЕЛАТЬ", "ВЫП", "ВЫПОЛНЯТЬ"}

	//КсЗапись -- RECORD
	КсЗапись = []types.UWord{"RECORD", "ЗАПИСЬ"}

	//КсЯвляется -- IS
	КсЯвляется = []types.UWord{"IS", "ЕСТЬ"}

	//КлючСлово -- список ключевых слов
	КлючСлово = [][]types.UWord{КсМодуль, КсИмпорт, КсКонст, КсТипы, КсБулево, КсБайт, КсЦелое, КсЛит, КсНабор,
		КсВещ, КсПер, КсУказ, КсДо, КсМассив, КсИз, КсНачало, КсКонец, КсПроцедура, КсДля,
		КсПока, КсПовтор, КсЗапись, КсЯвляется}
)
