package пакСлово

/*
	Содержит все константы, которые могут содержаться в словах
*/

var (
	// ключевые слова

	//КсМодуль -- MODULE
	КсМодуль = []UWord{"MODULE", "МОДУЛЬ"}

	//КсИмпорт -- IMPORT
	КсИмпорт = []UWord{"IMPORT", "ИМПОРТ"}

	//КсКонст -- CONST
	КсКонст = []UWord{"CONST", "КОНСТ"}

	//КсТипы -- TYPE
	КсТипы = []UWord{"TYPE", "ТИПЫ"}

	//КсБулево -- BOOLEAN
	КсБулево = []UWord{"BOOLEAN", "БУЛЕВО"}

	//КсБайт -- BYTE
	КсБайт = []UWord{"BYTE", "БАЙТ"}

	//КсЦелое -- INTEGER
	КсЦелое = []UWord{"INTEGER", "ЦЕЛОЕ"}

	//КсЛит -- CHAR
	КсЛит = []UWord{"CHAR", "ЛИТ"}

	//КсНабор -- SET
	КсНабор = []UWord{"SET", "НАБОР"}

	//КсВещ -- REAL
	КсВещ = []UWord{"REAL", "ДРОБ", "ВЕЩ"}

	//КсПер -- VAR
	КсПер = []UWord{"VAR", "ПЕРЕМ", "ССЫЛКА"}

	//КсУказ -- POINTER
	КсУказ = []UWord{"POINTER", "УКАЗ", "УКАЗАТЕЛЬ"}

	//КсДо -- TO
	КсДо = []UWord{"TO", "НА"}

	//КсМассив -- ARRAY
	КсМассив = []UWord{"ARRAY", "МАС", "МАССИВ"}

	//КсИз -- OF
	КсИз = []UWord{"OF", "ИЗ"}

	//КсНачало -- BEGIN
	КсНачало = []UWord{"BEGIN", "НАЧ", "НАЧАЛО"}

	//КсКонец -- END
	КсКонец = []UWord{"END", "КОНЕЦ"}

	//КсПроцедура -- PROCEDURE
	КсПроцедура = []UWord{"PROCEDURE", "ПРОЦ", "ПРОЦЕДУРА"}

	//КсДля -- FOR
	КсДля = []UWord{"FOR", "ДЛЯ"}

	//КсПока -- WHILE
	КсПока = []UWord{"WHILE", "ПОКА"}

	//КсПовтор -- DO
	КсПовтор = []UWord{"DO", "ДЕЛАТЬ", "ВЫП", "ВЫПОЛНЯТЬ"}

	//КсЗапись -- RECORD
	КсЗапись = []UWord{"RECORD", "ЗАПИСЬ"}

	//КсЯвляется -- IS
	КсЯвляется = []UWord{"IS", "ЕСТЬ"}

	//КлючСлово -- список ключевых слов
	КлючСлово = [][]UWord{КсМодуль, КсИмпорт, КсКонст, КсТипы, КсБулево, КсБайт, КсЦелое, КсЛит, КсНабор,
		КсВещ, КсПер, КсУказ, КсДо, КсМассив, КсИз, КсНачало, КсКонец, КсПроцедура, КсДля,
		КсПока, КсПовтор, КсЗапись, КсЯвляется}
)
