package пакСловоРод

/*
	Модуль предоставляет константы для рода слова
*/

const (
	// константы сущностей

	//КПусто -- если род пустой
	КПусто = iota

	//КЗапятая -- ","
	КЗапятая

	//КТочкаЗапятая -- ";"
	КТочкаЗапятая

	//КИмя -- Имя пользовательской сущности
	КИмя

	//ККомментНачать -- "(*"
	ККомментНачать

	//ККомментЗакончить -- "*)"
	ККомментЗакончить

	//КОпределить -- ":"
	КОпределить

	//КПрисвоить -- ":="
	КПрисвоить

	//КСкобкаОткрКругл -- "("
	КСкобкаОткрКругл

	//КСкобкаЗакрКругл -- ")"
	КСкобкаЗакрКругл

	//КДвоеточие -- ":"
	КДвоеточие

	//КДелить -- "/"
	КДелить

	//КУмножить -- "*"
	КУмножить

	//КМинус -- "-"
	КМинус

	//КПлюс -- "+"
	КПлюс

	//КЧисло -- род число
	КЧисло

	//КСтрока -- что-то в двойных кавычках
	КСтрока

	//КРавно -- "="
	КРавно

	//КТочка -- "."
	КТочка
)
