package main

/*
	Модуль определяет точку входа всего приложения
*/

import (
	мПрилож "oc/internal/app"
	мПарам "oc/internal/app/param"
	мЛог "oc/internal/log"
	мШапка "oc/internal/splashscreen"
)

func main() {
	режим := мЛог.КОтладка
	парам := &мПарам.ТПарам{
		Версия: "0.0.5",
		Сборка: "0060",
		Дата:   "2020-08-22 21:05:07",
		Режим:  режим,
	}
	мШапка.Печать(парам)
	лог := мЛог.Нов("main.go", режим)
	лог.Отладка("main", "Начало работы компилятора")
	прилож, ош := мПрилож.Нов(парам)
	switch ош == nil {
	case true:
		прилож.Пуск()
	default:
		лог.Паника("main", "Запуск приложения\n\t%v", ош)
	}
}
