package main

/*
	Модуль определяет точку входа всего приложения
*/

import (
	мПрилож "oc/internal/app"
	мПарам "oc/internal/app/param"
	мЛог "oc/internal/log"
	мШапка "oc/internal/splashscreen"
)

func main() {
	режим := мЛог.КОтладка
	парам := &мПарам.ТПарам{
		Версия: "0.0.6",
		Сборка: "0070",
		Дата:   "2020-08-31 22:03:00",
		Режим:  режим,
	}
	мШапка.Печать(парам)
	лог := мЛог.Нов("main", режим)
	лог.Отладка("main", "Начало работы компилятора")
	прилож, ош := мПрилож.Нов(парам)
	if ош != nil {
		лог.Паника("main", "Запуск приложения", ош)
	}
	прилож.Пуск()
}
