package poolword

/*
	Модуль предоставляет тип пула слов модуля.
*/

import (
	"fmt"
	мТип "oc/internal/types"
)

//тПулСлова -- операции с пулом слов
type ТПулСлова struct {
	пул []мТип.IWord
}

//Нов - -возвращает указатель на новый ТПулСлова
func Нов() (пул *ТПулСлова) {
	return &ТПулСлова{
		пул: make([]мТип.IWord, 0),
	}
}

//Доб -- добавляет слово в пул
func (сам *ТПулСлова) Доб(пСлово мТип.IWord) (ош error) {
	if пСлово == nil {
		return fmt.Errorf("ТПулСлово.Доб(): ОШИБКа пСлово==nil")
	}
	сам.пул = append(сам.пул, пСлово)
	return nil
}

func (сам *ТПулСлова) Len() int {
	return len(сам.пул)
}
