package пакКоорд

// модКоордИзм

/*
	Модуль описывает тип с изменяемыми координатами
*/

import (
	//пакКонс "../../../пакКонсоль"
	пакФмт "fmt"
)

//ТКоордИзм -- тип для изменяемых координат
type ТКоордИзм struct {
	ТКоордФикс
}

//НовыйИзм -- возвращает новый экземпляр изменяемых координат
func НовыйИзм(пСтр ТЦелСтр, пПоз ТЦелПоз) (ки *ТКоордИзм, ош error) {
	if кф, ош := НовыйФикс(пСтр, пПоз); ош == nil {
		ки = &ТКоордИзм{ТКоордФикс: *кф}
	} else {
		ош = пакФмт.Errorf("пакКоорд.НовыйИзм(): ошибка при создании базы ТКоордФикс\n\t%v", ош)
		return nil, ош
	}
	return ки, nil
}

//ПозДоб -- увеличение координаты Поз на 1
func (сам *ТКоордИзм) ПозДоб() {
	сам.поз++
}

//ПозСброс -- сбрасывает позицию литеры в строке в 0
func (сам *ТКоордИзм) ПозСброс() {
	сам.поз = 0
}

//ПозУст -- устанавливает позицию литеры в строке
func (сам *ТКоордИзм) ПозУст(пПоз ТЦелПоз) (ош error) {
	if пПоз < 0 {
		ош = пакФмт.Errorf("ТКоордИзм.ПозУст(): отрицательный пПоз запрещён, пПоз=%v", пПоз)
		return ош
	}
	сам.поз = пПоз
	return nil
}

//СтрДоб -- увеличивает номер строки в ТуКоорд
func (сам *ТКоордИзм) СтрДоб() {
	сам.стр++
}

//String -- для соответствия интерфейсу ИКоордФикс
func (сам *ТКоордИзм) String() string {
	return "*ТКоордИзм{стр:" + пакФмт.Sprintf("%v", сам.стр) + ", поз:" + пакФмт.Sprintf("%v", сам.поз) + "}"
}
