package пакСлово

/*
	Содержит все константы, которые могут содержаться в словах
*/

var (
	// ключевые слова

	//КсМодуль -- MODULE
	КсМодуль = []ССлово{"MODULE", "МОДУЛЬ"}

	//КсИмпорт -- IMPORT
	КсИмпорт = []ССлово{"IMPORT", "ИМПОРТ"}

	//КсКонст -- CONST
	КсКонст = []ССлово{"CONST", "КОНСТ"}

	//КсТипы -- TYPE
	КсТипы = []ССлово{"TYPE", "ТИПЫ"}

	//КсБулево -- BOOLEAN
	КсБулево = []ССлово{"BOOLEAN", "БУЛЕВО"}

	//КсБайт -- BYTE
	КсБайт = []ССлово{"BYTE", "БАЙТ"}

	//КсЦелое -- INTEGER
	КсЦелое = []ССлово{"INTEGER", "ЦЕЛОЕ"}

	//КсЛит -- CHAR
	КсЛит = []ССлово{"CHAR", "ЛИТ"}

	//КсНабор -- SET
	КсНабор = []ССлово{"SET", "НАБОР"}

	//КсВещ -- REAL
	КсВещ = []ССлово{"REAL", "ДРОБ", "ВЕЩ"}

	//КсПер -- VAR
	КсПер = []ССлово{"VAR", "ПЕРЕМ", "ССЫЛКА"}

	//КсУказ -- POINTER
	КсУказ = []ССлово{"POINTER", "УКАЗ", "УКАЗАТЕЛЬ"}

	//КсДо -- TO
	КсДо = []ССлово{"TO", "НА"}

	//КсМассив -- ARRAY
	КсМассив = []ССлово{"ARRAY", "МАС", "МАССИВ"}

	//КсИз -- OF
	КсИз = []ССлово{"OF", "ИЗ"}

	//КсНачало -- BEGIN
	КсНачало = []ССлово{"BEGIN", "НАЧ", "НАЧАЛО"}

	//КсКонец -- END
	КсКонец = []ССлово{"END", "КОНЕЦ"}

	//КсПроцедура -- PROCEDURE
	КсПроцедура = []ССлово{"PROCEDURE", "ПРОЦ", "ПРОЦЕДУРА"}

	//КсДля -- FOR
	КсДля = []ССлово{"FOR", "ДЛЯ"}

	//КсПока -- WHILE
	КсПока = []ССлово{"WHILE", "ПОКА"}

	//КсПовтор -- DO
	КсПовтор = []ССлово{"DO", "ДЕЛАТЬ", "ВЫП", "ВЫПОЛНЯТЬ"}

	//КсЗапись -- RECORD
	КсЗапись = []ССлово{"RECORD", "ЗАПИСЬ"}

	//КсЯвляется -- IS
	КсЯвляется = []ССлово{"IS", "ЕСТЬ"}

	//КлючСлово -- список ключевых слов
	КлючСлово = [][]ССлово{КсМодуль, КсИмпорт, КсКонст, КсТипы, КсБулево, КсБайт, КсЦелое, КсЛит, КсНабор,
		КсВещ, КсПер, КсУказ, КсДо, КсМассив, КсИз, КсНачало, КсКонец, КсПроцедура, КсДля,
		КсПока, КсПовтор, КсЗапись, КсЯвляется}
)
